[
  {
    "chapter": 7,
    "verse": 1,
    "text": "Yea, for thus saith the Lord: Have I put thee away, or have I cast thee off forever? For thus saith the Lord: Where is the bill of your mother’s divorcement? To whom have I put thee away, or to which of my creditors have I sold you? Yea, to whom have I sold you? Behold, for your iniquities have ye sold yourselves, and for your transgressions is your mother put away."
  },
  {
    "chapter": 7,
    "verse": 2,
    "text": "Wherefore, when I came, there was no man; when I called, yea, there was none to answer. O house of Israel, is my hand shortened at all that it cannot redeem, or have I no power to deliver? Behold, at my rebuke I dry up the sea, I make their rivers a wilderness and their fish to stink because the waters are dried up, and they die because of thirst."
  },
  {
    "chapter": 7,
    "verse": 3,
    "text": "I clothe the heavens with blackness, and I make sackcloth their covering."
  },
  {
    "chapter": 7,
    "verse": 4,
    "text": "The Lord God hath given me the tongue of the learned, that I should know how to speak a word in season unto thee, O house of Israel. When ye are weary he waketh morning by morning. He waketh mine ear to hear as the learned."
  },
  {
    "chapter": 7,
    "verse": 5,
    "text": "The Lord God hath opened mine ear, and I was not rebellious, neither turned away back."
  },
  {
    "chapter": 7,
    "verse": 6,
    "text": "I gave my back to the smiter, and my cheeks to them that plucked off the hair. I hid not my face from shame and spitting."
  },
  {
    "chapter": 7,
    "verse": 7,
    "text": "For the Lord God will help me, therefore shall I not be confounded. Therefore have I set my face like a flint, and I know that I shall not be ashamed."
  },
  {
    "chapter": 7,
    "verse": 8,
    "text": "And the Lord is near, and he justifieth me. Who will contend with me? Let us stand together. Who is mine adversary? Let him come near me, and I will smite him with the strength of my mouth."
  },
  {
    "chapter": 7,
    "verse": 9,
    "text": "For the Lord God will help me. And all they who shall condemn me, behold, all they shall wax old as a garment, and the moth shall eat them up."
  },
  {
    "chapter": 7,
    "verse": 10,
    "text": "Who is among you that feareth the Lord, that obeyeth the voice of his servant, that walketh in darkness and hath no light?"
  },
  {
    "chapter": 7,
    "verse": 11,
    "text": "Behold all ye that kindle fire, that compass yourselves about with sparks, walk in the light of your fire and in the sparks which ye have kindled. This shall ye have of mine hand—ye shall lie down in sorrow."
  },
  {
    "chapter": 8,
    "verse": 1,
    "text": "Hearken unto me, ye that follow after righteousness. Look unto the rock from whence ye are hewn, and to the hole of the pit from whence ye are digged."
  },
  {
    "chapter": 8,
    "verse": 2,
    "text": "Look unto Abraham, your father, and unto Sarah, she that bare you; for I called him alone, and blessed him."
  },
  {
    "chapter": 8,
    "verse": 3,
    "text": "For the Lord shall comfort Zion, he will comfort all her waste places; and he will make her wilderness like Eden, and her desert like the garden of the Lord. Joy and gladness shall be found therein, thanksgiving and the voice of melody."
  },
  {
    "chapter": 8,
    "verse": 4,
    "text": "Hearken unto me, my people; and give ear unto me, O my nation; for a law shall proceed from me, and I will make my judgment to rest for a light for the people."
  },
  {
    "chapter": 8,
    "verse": 5,
    "text": "My righteousness is near; my salvation is gone forth, and mine arm shall judge the people. The isles shall wait upon me, and on mine arm shall they trust."
  },
  {
    "chapter": 8,
    "verse": 6,
    "text": "Lift up your eyes to the heavens, and look upon the earth beneath; for the heavens shall vanish away like smoke, and the earth shall wax old like a garment; and they that dwell therein shall die in like manner. But my salvation shall be forever, and my righteousness shall not be abolished."
  },
  {
    "chapter": 8,
    "verse": 7,
    "text": "Hearken unto me, ye that know righteousness, the people in whose heart I have written my law, fear ye not the reproach of men, neither be ye afraid of their revilings."
  },
  {
    "chapter": 8,
    "verse": 8,
    "text": "For the moth shall eat them up like a garment, and the worm shall eat them like wool. But my righteousness shall be forever, and my salvation from generation to generation."
  },
  {
    "chapter": 8,
    "verse": 9,
    "text": "Awake, awake! Put on strength, O arm of the Lord; awake as in the ancient days. Art thou not he that hath cut Rahab, and wounded the dragon?"
  },
  {
    "chapter": 8,
    "verse": 10,
    "text": "Art thou not he who hath dried the sea, the waters of the great deep; that hath made the depths of the sea a way for the ransomed to pass over?"
  },
  {
    "chapter": 8,
    "verse": 11,
    "text": "Therefore, the redeemed of the Lord shall return, and come with singing unto Zion; and everlasting joy and holiness shall be upon their heads; and they shall obtain gladness and joy; sorrow and mourning shall flee away."
  },
  {
    "chapter": 8,
    "verse": 12,
    "text": "I am he; yea, I am he that comforteth you. Behold, who art thou, that thou shouldst be afraid of man, who shall die, and of the son of man, who shall be made like unto grass?"
  },
  {
    "chapter": 8,
    "verse": 13,
    "text": "And forgettest the Lord thy maker, that hath stretched forth the heavens, and laid the foundations of the earth, and hast feared continually every day, because of the fury of the oppressor, as if he were ready to destroy? And where is the fury of the oppressor?"
  },
  {
    "chapter": 8,
    "verse": 14,
    "text": "The captive exile hasteneth, that he may be loosed, and that he should not die in the pit, nor that his bread should fail."
  },
  {
    "chapter": 8,
    "verse": 15,
    "text": "But I am the Lord thy God, whose waves roared; the Lord of Hosts is my name."
  },
  {
    "chapter": 8,
    "verse": 16,
    "text": "And I have put my words in thy mouth, and have covered thee in the shadow of mine hand, that I may plant the heavens and lay the foundations of the earth, and say unto Zion: Behold, thou art my people."
  },
  {
    "chapter": 8,
    "verse": 17,
    "text": "Awake, awake, stand up, O Jerusalem, which hast drunk at the hand of the Lord the cup of his fury—thou hast drunken the dregs of the cup of trembling wrung out—"
  },
  {
    "chapter": 8,
    "verse": 18,
    "text": "And none to guide her among all the sons she hath brought forth; neither that taketh her by the hand, of all the sons she hath brought up."
  },
  {
    "chapter": 8,
    "verse": 19,
    "text": "These two sons are come unto thee, who shall be sorry for thee—thy desolation and destruction, and the famine and the sword—and by whom shall I comfort thee?"
  },
  {
    "chapter": 8,
    "verse": 20,
    "text": "Thy sons have fainted, save these two; they lie at the head of all the streets; as a wild bull in a net, they are full of the fury of the Lord, the rebuke of thy God."
  },
  {
    "chapter": 8,
    "verse": 21,
    "text": "Therefore hear now this, thou afflicted, and drunken, and not with wine:"
  },
  {
    "chapter": 8,
    "verse": 22,
    "text": "Thus saith thy Lord, the Lord and thy God pleadeth the cause of his people; behold, I have taken out of thine hand the cup of trembling, the dregs of the cup of my fury; thou shalt no more drink it again."
  },
  {
    "chapter": 8,
    "verse": 23,
    "text": "But I will put it into the hand of them that afflict thee; who have said to thy soul: Bow down, that we may go over—and thou hast laid thy body as the ground and as the street to them that went over."
  },
  {
    "chapter": 8,
    "verse": 24,
    "text": "Awake, awake, put on thy strength, O Zion; put on thy beautiful garments, O Jerusalem, the holy city; for henceforth there shall no more come into thee the uncircumcised and the unclean."
  },
  {
    "chapter": 8,
    "verse": 25,
    "text": "Shake thyself from the dust; arise, sit down, O Jerusalem; loose thyself from the bands of thy neck, O captive daughter of Zion."
  }
]
