[
  {
    "chapter": 21,
    "verse": 1,
    "text": "And it came to pass that he commanded the multitude that they should cease to pray, and also his disciples. And he commanded them that they should not cease to pray in their hearts.",
    "source": "https://www.churchofjesuschrist.org/study/scriptures/bofm/3-ne/20?lang=eng&id=p1#p1"
  },
  {
    "chapter": 21,
    "verse": 2,
    "text": "And he commanded them that they should arise and stand up upon their feet. And they arose up and stood upon their feet.",
    "source": "https://www.churchofjesuschrist.org/study/scriptures/bofm/3-ne/20?lang=eng&id=p2#p2"
  },
  {
    "chapter": 21,
    "verse": 3,
    "text": "And it came to pass that he brake bread again and blessed it, and gave to the disciples to eat.",
    "source": "https://www.churchofjesuschrist.org/study/scriptures/bofm/3-ne/20?lang=eng&id=p3#p3"
  },
  {
    "chapter": 21,
    "verse": 4,
    "text": "And when they had eaten he commanded them that they should break bread, and give unto the multitude.",
    "source": "https://www.churchofjesuschrist.org/study/scriptures/bofm/3-ne/20?lang=eng&id=p4#p4"
  },
  {
    "chapter": 21,
    "verse": 5,
    "text": "And when they had given unto the multitude he also gave them wine to drink, and commanded them that they should give unto the multitude.",
    "source": "https://www.churchofjesuschrist.org/study/scriptures/bofm/3-ne/20?lang=eng&id=p5#p5"
  },
  {
    "chapter": 21,
    "verse": 6,
    "text": "Now, there had been no bread, neither wine, brought by the disciples, neither by the multitude;",
    "source": "https://www.churchofjesuschrist.org/study/scriptures/bofm/3-ne/20?lang=eng&id=p6#p6"
  },
  {
    "chapter": 21,
    "verse": 7,
    "text": "But he truly gave unto them bread to eat, and also wine to drink.",
    "source": "https://www.churchofjesuschrist.org/study/scriptures/bofm/3-ne/20?lang=eng&id=p7#p7"
  },
  {
    "chapter": 21,
    "verse": 8,
    "text": "And he said unto them: He that eateth this bread eateth of my body to his soul; and he that drinketh of this wine drinketh of my blood to his soul; and his soul shall never hunger nor thirst, but shall be filled.",
    "source": "https://www.churchofjesuschrist.org/study/scriptures/bofm/3-ne/20?lang=eng&id=p8#p8"
  },
  {
    "chapter": 21,
    "verse": 9,
    "text": "Now, when the multitude had all eaten and drunk, behold, they were filled with the Spirit; and they did cry out with one voice, and gave glory to Jesus, whom they both saw and heard.",
    "source": "https://www.churchofjesuschrist.org/study/scriptures/bofm/3-ne/20?lang=eng&id=p9#p9"
  },
  {
    "chapter": 21,
    "verse": 10,
    "text": "And it came to pass that when they had all given glory unto Jesus, he said unto them: Behold now I finish the commandment which the Father hath commanded me concerning this people, who are a remnant of the house of Israel.",
    "source": "https://www.churchofjesuschrist.org/study/scriptures/bofm/3-ne/20?lang=eng&id=p10#p10"
  },
  {
    "chapter": 21,
    "verse": 11,
    "text": "Ye remember that I spake unto you, and said that when the words of Isaiah should be fulfilled—behold they are written, ye have them before you, therefore search them—",
    "source": "https://www.churchofjesuschrist.org/study/scriptures/bofm/3-ne/20?lang=eng&id=p11#p11"
  },
  {
    "chapter": 21,
    "verse": 12,
    "text": "And verily, verily, I say unto you, that when they shall be fulfilled then is the fulfilling of the covenant which the Father hath made unto his people, O house of Israel.",
    "source": "https://www.churchofjesuschrist.org/study/scriptures/bofm/3-ne/20?lang=eng&id=p12#p12"
  },
  {
    "chapter": 21,
    "verse": 13,
    "text": "And then shall the remnants, which shall be scattered abroad upon the face of the earth, be gathered in from the east and from the west, and from the south and from the north; and they shall be brought to the knowledge of the Lord their God, who hath redeemed them.",
    "source": "https://www.churchofjesuschrist.org/study/scriptures/bofm/3-ne/20?lang=eng&id=p13#p13"
  },
  {
    "chapter": 21,
    "verse": 14,
    "text": "And the Father hath commanded me that I should give unto you this land, for your inheritance.",
    "source": "https://www.churchofjesuschrist.org/study/scriptures/bofm/3-ne/20?lang=eng&id=p14#p14"
  },
  {
    "chapter": 21,
    "verse": 15,
    "text": "And I say unto you, that if the Gentiles do not repent after the blessing which they shall receive, after they have scattered my people—",
    "source": "https://www.churchofjesuschrist.org/study/scriptures/bofm/3-ne/20?lang=eng&id=p15#p15"
  }
]
