[
  {
    "chapter": 4,
    "verse": 1,
    "text": "For behold, the day cometh that shall burn as an oven, and all the proud, yea, and all that do wickedly shall burn as stubble; for they that come shall burn them, saith the Lord of Hosts, that it shall leave them neither root nor branch.",
    "source": "https://www.churchofjesuschrist.org/study/scriptures/pgp/js-h/1?lang=eng&id=p37#p37"
  },
  {
    "chapter": 4,
    "verse": 2,
    "text": "¶ But unto you that fear my name shall the Sun of righteousness arise with healing in his wings; and ye shall go forth, and grow up as calves of the stall.",
    "source": "https://www.churchofjesuschrist.org/study/scriptures/ot/mal/4?lang=eng&id=p2#p2"
  },
  {
    "chapter": 4,
    "verse": 3,
    "text": "And ye shall tread down the wicked; for they shall be ashes under the soles of your feet in the day that I shall do this, saith the Lord of hosts.",
    "source": "https://www.churchofjesuschrist.org/study/scriptures/ot/mal/4?lang=eng&id=p3#p3"
  },
  {
    "chapter": 4,
    "verse": 4,
    "text": "¶ Remember ye the law of Moses my servant, which I commanded unto him in Horeb for all Israel, with the statutes and judgments.",
    "source": "https://www.churchofjesuschrist.org/study/scriptures/ot/mal/4?lang=eng&id=p4#p4"
  },
  {
    "chapter": 2,
    "verse": 1,
    "text": "Behold, I will reveal unto you the Priesthood, by the hand of Elijah the prophet, before the coming of the great and dreadful day of the Lord.",
    "source": "https://www.churchofjesuschrist.org/study/scriptures/dc-testament/dc/2?lang=eng&id=p1#p1"
  },
  {
    "chapter": 2,
    "verse": 2,
    "text": "And he shall plant in the hearts of the children the promises made to the fathers, and the hearts of the children shall turn to their fathers.",
    "source": "https://www.churchofjesuschrist.org/study/scriptures/dc-testament/dc/2?lang=eng&id=p2#p2"
  },
  {
    "chapter": 2,
    "verse": 3,
    "text": "If it were not so, the whole earth would be utterly wasted at his coming.",
    "source": "https://www.churchofjesuschrist.org/study/scriptures/dc-testament/dc/2?lang=eng&id=p3#p3"
  }
]
