[
  {
    "chapter": 6,
    "verse": 1,
    "text": "A great and marvelous work is about to come forth unto the children of men.",
    "source": "https://www.churchofjesuschrist.org/study/scriptures/dc-testament/dc/6?lang=eng&id=p1#p1"
  },
  {
    "chapter": 6,
    "verse": 2,
    "text": "Behold, I am God; give heed unto my word, which is quick and powerful, sharper than a two-edged sword, to the dividing asunder of both joints and marrow; therefore give heed unto my words.",
    "source": "https://www.churchofjesuschrist.org/study/scriptures/dc-testament/dc/6?lang=eng&id=p2#p2"
  },
  {
    "chapter": 6,
    "verse": 3,
    "text": "Behold, the field is white already to harvest; therefore, whoso desireth to reap, let him thrust in his sickle with his might, and reap while the day lasts, that he may treasure up for his soul everlasting salvation in the kingdom of God.",
    "source": "https://www.churchofjesuschrist.org/study/scriptures/dc-testament/dc/6?lang=eng&id=p3#p3"
  },
  {
    "chapter": 6,
    "verse": 4,
    "text": "Yea, whosoever will thrust in his sickle and reap, the same is called of God.",
    "source": "https://www.churchofjesuschrist.org/study/scriptures/dc-testament/dc/6?lang=eng&id=p4#p4"
  },
  {
    "chapter": 6,
    "verse": 5,
    "text": "Therefore, if you will ask of me you shall receive; if you will knock it shall be opened unto you.",
    "source": "https://www.churchofjesuschrist.org/study/scriptures/dc-testament/dc/6?lang=eng&id=p5#p5"
  },
  {
    "chapter": 6,
    "verse": 6,
    "text": "Now, as you have asked, behold, I say unto you, keep my commandments, and seek to bring forth and establish the cause of Zion;",
    "source": "https://www.churchofjesuschrist.org/study/scriptures/dc-testament/dc/6?lang=eng&id=p6#p6"
  },
  {
    "chapter": 6,
    "verse": 7,
    "text": "Seek not for riches but for wisdom, and behold, the mysteries of God shall be unfolded unto you, and then shall you be made rich. Behold, he that hath eternal life is rich.",
    "source": "https://www.churchofjesuschrist.org/study/scriptures/dc-testament/dc/6?lang=eng&id=p7#p7"
  },
  {
    "chapter": 6,
    "verse": 8,
    "text": "Verily, verily, I say unto you, even as you desire of me so it shall be unto you; and if you desire, you shall be the means of doing much good in this generation.",
    "source": "https://www.churchofjesuschrist.org/study/scriptures/dc-testament/dc/6?lang=eng&id=p8#p8"
  },
  {
    "chapter": 6,
    "verse": 9,
    "text": "Say nothing but repentance unto this generation; keep my commandments, and assist to bring forth my work, according to my commandments, and you shall be blessed.",
    "source": "https://www.churchofjesuschrist.org/study/scriptures/dc-testament/dc/6?lang=eng&id=p9#p9"
  },
  {
    "chapter": 6,
    "verse": 10,
    "text": "Behold thou hast a gift, and blessed art thou because of thy gift. Remember it is sacred and cometh from above—",
    "source": "https://www.churchofjesuschrist.org/study/scriptures/dc-testament/dc/6?lang=eng&id=p10#p10"
  },
  {
    "chapter": 6,
    "verse": 11,
    "text": "And if thou wilt inquire, thou shalt know mysteries which are great and marvelous; therefore thou shalt exercise thy gift, that thou mayest find out mysteries, that thou mayest bring many to the knowledge of the truth, yea, convince them of the error of their ways.",
    "source": "https://www.churchofjesuschrist.org/study/scriptures/dc-testament/dc/6?lang=eng&id=p11#p11"
  },
  {
    "chapter": 6,
    "verse": 12,
    "text": "Make not thy gift known unto any save it be those who are of thy faith. Trifle not with sacred things.",
    "source": "https://www.churchofjesuschrist.org/study/scriptures/dc-testament/dc/6?lang=eng&id=p12#p12"
  },
  {
    "chapter": 6,
    "verse": 13,
    "text": "If thou wilt do good, yea, and hold out faithful to the end, thou shalt be saved in the kingdom of God, which is the greatest of all the gifts of God; for there is no gift greater than the gift of salvation.",
    "source": "https://www.churchofjesuschrist.org/study/scriptures/dc-testament/dc/6?lang=eng&id=p13#p13"
  },
  {
    "chapter": 6,
    "verse": 14,
    "text": "Verily, verily, I say unto thee, blessed art thou for what thou hast done; for thou hast inquired of me, and behold, as often as thou hast inquired thou hast received instruction of my Spirit. If it had not been so, thou wouldst not have come to the place where thou art at this time.",
    "source": "https://www.churchofjesuschrist.org/study/scriptures/dc-testament/dc/6?lang=eng&id=p14#p14"
  },
  {
    "chapter": 6,
    "verse": 15,
    "text": "Behold, thou knowest that thou hast inquired of me and I did enlighten thy mind; and now I tell thee these things that thou mayest know that thou hast been enlightened by the Spirit of truth;",
    "source": "https://www.churchofjesuschrist.org/study/scriptures/dc-testament/dc/6?lang=eng&id=p15#p15"
  },
  {
    "chapter": 6,
    "verse": 16,
    "text": "Yea, I tell thee, that thou mayest know that there is none else save God that knowest thy thoughts and the intents of thy heart.",
    "source": "https://www.churchofjesuschrist.org/study/scriptures/dc-testament/dc/6?lang=eng&id=p16#p16"
  },
  {
    "chapter": 6,
    "verse": 17,
    "text": "I tell thee these things as a witness unto thee—that the words or the work which thou hast been writing are true.",
    "source": "https://www.churchofjesuschrist.org/study/scriptures/dc-testament/dc/6?lang=eng&id=p17#p17"
  },
  {
    "chapter": 6,
    "verse": 18,
    "text": "Therefore be diligent; stand by my servant Joseph, faithfully, in whatsoever difficult circumstances he may be for the word’s sake.",
    "source": "https://www.churchofjesuschrist.org/study/scriptures/dc-testament/dc/6?lang=eng&id=p18#p18"
  },
  {
    "chapter": 6,
    "verse": 19,
    "text": "Admonish him in his faults, and also receive admonition of him. Be patient; be sober; be temperate; have patience, faith, hope and charity.",
    "source": "https://www.churchofjesuschrist.org/study/scriptures/dc-testament/dc/6?lang=eng&id=p19#p19"
  },
  {
    "chapter": 6,
    "verse": 20,
    "text": "Behold, thou art Oliver, and I have spoken unto thee because of thy desires; therefore treasure up these words in thy heart. Be faithful and diligent in keeping the commandments of God, and I will encircle thee in the arms of my love.",
    "source": "https://www.churchofjesuschrist.org/study/scriptures/dc-testament/dc/6?lang=eng&id=p20#p20"
  },
  {
    "chapter": 6,
    "verse": 21,
    "text": "Behold, I am Jesus Christ, the Son of God. I am the same that came unto mine own, and mine own received me not. I am the light which shineth in darkness, and the darkness comprehendeth it not.",
    "source": "https://www.churchofjesuschrist.org/study/scriptures/dc-testament/dc/6?lang=eng&id=p21#p21"
  },
  {
    "chapter": 6,
    "verse": 22,
    "text": "Verily, verily, I say unto you, if you desire a further witness, cast your mind upon the night that you cried unto me in your heart, that you might know concerning the truth of these things.",
    "source": "https://www.churchofjesuschrist.org/study/scriptures/dc-testament/dc/6?lang=eng&id=p22#p22"
  },
  {
    "chapter": 6,
    "verse": 23,
    "text": "Did I not speak peace to your mind concerning the matter? What greater witness can you have than from God?",
    "source": "https://www.churchofjesuschrist.org/study/scriptures/dc-testament/dc/6?lang=eng&id=p23#p23"
  },
  {
    "chapter": 6,
    "verse": 24,
    "text": "And now, behold, you have received a witness; for if I have told you things which no man knoweth have you not received a witness?",
    "source": "https://www.churchofjesuschrist.org/study/scriptures/dc-testament/dc/6?lang=eng&id=p24#p24"
  },
  {
    "chapter": 6,
    "verse": 25,
    "text": "And, behold, I grant unto you a gift, if you desire of me, to translate, even as my servant Joseph.",
    "source": "https://www.churchofjesuschrist.org/study/scriptures/dc-testament/dc/6?lang=eng&id=p25#p25"
  },
  {
    "chapter": 6,
    "verse": 26,
    "text": "Verily, verily, I say unto you, that there are records which contain much of my gospel, which have been kept back because of the wickedness of the people;",
    "source": "https://www.churchofjesuschrist.org/study/scriptures/dc-testament/dc/6?lang=eng&id=p26#p26"
  },
  {
    "chapter": 6,
    "verse": 27,
    "text": "And now I command you, that if you have good desires—a desire to lay up treasures for yourself in heaven—then shall you assist in bringing to light, with your gift, those parts of my scriptures which have been hidden because of iniquity.",
    "source": "https://www.churchofjesuschrist.org/study/scriptures/dc-testament/dc/6?lang=eng&id=p27#p27"
  },
  {
    "chapter": 6,
    "verse": 28,
    "text": "And now, behold, I give unto you, and also unto my servant Joseph, the keys of this gift, which shall bring to light this ministry; and in the mouth of two or three witnesses shall every word be established.",
    "source": "https://www.churchofjesuschrist.org/study/scriptures/dc-testament/dc/6?lang=eng&id=p28#p28"
  },
  {
    "chapter": 6,
    "verse": 29,
    "text": "Verily, verily, I say unto you, if they reject my words, and this part of my gospel and ministry, blessed are ye, for they can do no more unto you than unto me.",
    "source": "https://www.churchofjesuschrist.org/study/scriptures/dc-testament/dc/6?lang=eng&id=p29#p29"
  },
  {
    "chapter": 6,
    "verse": 30,
    "text": "And even if they do unto you even as they have done unto me, blessed are ye, for you shall dwell with me in glory.",
    "source": "https://www.churchofjesuschrist.org/study/scriptures/dc-testament/dc/6?lang=eng&id=p30#p30"
  },
  {
    "chapter": 6,
    "verse": 31,
    "text": "But if they reject not my words, which shall be established by the testimony which shall be given, blessed are they, and then shall ye have joy in the fruit of your labors.",
    "source": "https://www.churchofjesuschrist.org/study/scriptures/dc-testament/dc/6?lang=eng&id=p31#p31"
  },
  {
    "chapter": 6,
    "verse": 32,
    "text": "Verily, verily, I say unto you, as I said unto my disciples, where two or three are gathered together in my name, as touching one thing, behold, there will I be in the midst of them—even so am I in the midst of you.",
    "source": "https://www.churchofjesuschrist.org/study/scriptures/dc-testament/dc/6?lang=eng&id=p32#p32"
  },
  {
    "chapter": 6,
    "verse": 33,
    "text": "Fear not to do good, my sons, for whatsoever ye sow, that shall ye also reap; therefore, if ye sow good ye shall also reap good for your reward.",
    "source": "https://www.churchofjesuschrist.org/study/scriptures/dc-testament/dc/6?lang=eng&id=p33#p33"
  },
  {
    "chapter": 6,
    "verse": 34,
    "text": "Therefore, fear not, little flock; do good; let earth and hell combine against you, for if ye are built upon my rock, they cannot prevail.",
    "source": "https://www.churchofjesuschrist.org/study/scriptures/dc-testament/dc/6?lang=eng&id=p34#p34"
  },
  {
    "chapter": 6,
    "verse": 35,
    "text": "Behold, I do not condemn you; go your ways and sin no more; perform with soberness the work which I have commanded you.",
    "source": "https://www.churchofjesuschrist.org/study/scriptures/dc-testament/dc/6?lang=eng&id=p35#p35"
  },
  {
    "chapter": 6,
    "verse": 36,
    "text": "Look unto me in every thought; doubt not, fear not.",
    "source": "https://www.churchofjesuschrist.org/study/scriptures/dc-testament/dc/6?lang=eng&id=p36#p36"
  },
  {
    "chapter": 6,
    "verse": 37,
    "text": "Behold the wounds which pierced my side, and also the prints of the nails in my hands and feet; be faithful, keep my commandments, and ye shall inherit the kingdom of heaven. Amen.",
    "source": "https://www.churchofjesuschrist.org/study/scriptures/dc-testament/dc/6?lang=eng&id=p37#p37"
  }
]
